;******************************************************************************
;* PRU C/C++ Codegen                                                PC v2.1.1 *
;* Date/Time created: Sat Jun 24 12:47:56 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_version=3 --symdebug:dwarf --symdebug:dwarf_version=3 

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("AX12.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen PC v2.1.1 Copyright (c) 2012-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("D:\Programming\Robot\Bioloid\BioloidBeagleBone\BioloidBeaglebone\PRU_0")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("C:/ti/AM335X_StarterWare_02_00_01_01/PRUCodeGenerationTools/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x63)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)
$C$DW$3	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$3, DW_AT_type(*$C$DW$T$36)
$C$DW$4	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$4, DW_AT_type(*$C$DW$T$37)

	.dwattr $C$DW$285, DW_AT_TI_begin_file("AX12.c")
	.dwattr $C$DW$285, DW_AT_TI_begin_line(0x66)
	.dwattr $C$DW$285, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$285, DW_AT_decl_file("AX12.c")
	.dwattr $C$DW$285, DW_AT_decl_line(0x66)
	.dwattr $C$DW$285, DW_AT_decl_column(0x06)
	.dwattr $C$DW$285, DW_AT_TI_max_frame_size(0x02)
	.dwpsn	file "AX12.c",line 103,column 1,is_stmt,address ||AX12GetCCWComplianceMargin||,isa 0

	.dwfde $C$DW$CIE, ||AX12GetCCWComplianceMargin||
$C$DW$286	.dwtag  DW_TAG_formal_parameter, DW_AT_name("slot")
	.dwattr $C$DW$286, DW_AT_TI_symbol_name("slot")
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$286, DW_AT_location[DW_OP_regx 0x38]

;***************************************************************
;* FNAME: AX12GetCCWComplianceMargin    FR SIZE:   2           *
;*                                                             *
;* FUNCTION ENVIRONMENT                                        *
;*                                                             *
;* FUNCTION PROPERTIES                                         *
;*                            0 Auto,  2 SOE     *
;***************************************************************

||AX12GetCCWComplianceMargin||:
;* --------------------------------------------------------------------------*
;* r14_0 assigned to slot
$C$DW$287	.dwtag  DW_TAG_variable, DW_AT_name("slot")
	.dwattr $C$DW$287, DW_AT_TI_symbol_name("slot")
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$287, DW_AT_location[DW_OP_regx 0x38]
	.dwcfi	cfa_offset, 0
        SUB       r2, r2, 0x02          ; [] 
	.dwcfi	cfa_offset, 2
        SBBO      &r3.b2, r2, 0, 2      ; [] 
	.dwcfi	save_reg_to_mem, 14, -2
	.dwcfi	save_reg_to_mem, 15, -1
;*** 105	-----------------------    return (AX12s[slot]).ccwComplianceMargin;
	.dwpsn	file "AX12.c",line 105,column 2,is_stmt,isa 0
        MOV       r14, r14.b0           ; [] |105| slot
        LDI       r15, 0x0013           ; [] |105| 
$C$DW$288	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$288, DW_AT_low_pc(0x00)
	.dwattr $C$DW$288, DW_AT_name("__pruabi_mpyi")
	.dwattr $C$DW$288, DW_AT_TI_call
        JAL       r3.w2, ||__pruabi_mpyi|| ; [] |105| __pruabi_mpyi
        LDI       r0, ||AX12s||+4       ; [] |105| AX12s
        LBBO      &r14.b0, r0, r14, 1   ; [] |105| 
        LBBO      &r3.b2, r2, 0, 2      ; [] 
	.dwcfi	restore_reg, 14
	.dwcfi	restore_reg, 15
        ADD       r2, r2, 0x02          ; [] 
	.dwcfi	cfa_offset, 0
$C$DW$289	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$289, DW_AT_low_pc(0x00)
	.dwattr $C$DW$289, DW_AT_TI_return
        JMP       r3.w2                 ; [] 
	.dwattr $C$DW$285, DW_AT_TI_end_file("AX12.c")
	.dwattr $C$DW$285, DW_AT_TI_end_line(0x6b)
	.dwattr $C$DW$285, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$285

;* Inlined function references:
;* [ 38] AX12SetSyncInfo
;*****************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                             *
;*****************************************************************************
	.global	||uartTxPacket||
	.global	||uartRxPacket||
	.global	||dynamixelsPing||
	.global	||dynamixelsIsType||
	.global	||__vla_alloc||
	.global	||__vla_dealloc||
	.global	||__pruabi_mpyi||
	.global	||memcpy||

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$22	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
$C$DW$290	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxNoError"), DW_AT_const_value(0x00)
	.dwattr $C$DW$290, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$290, DW_AT_decl_line(0x41)
	.dwattr $C$DW$290, DW_AT_decl_column(0x02)
$C$DW$291	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxGeneralError"), DW_AT_const_value(0x80)
	.dwattr $C$DW$291, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$291, DW_AT_decl_line(0x42)
	.dwattr $C$DW$291, DW_AT_decl_column(0x02)
$C$DW$292	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxTimeout"), DW_AT_const_value(0x100)
	.dwattr $C$DW$292, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$292, DW_AT_decl_line(0x43)
	.dwattr $C$DW$292, DW_AT_decl_column(0x02)
$C$DW$293	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxHeaderError"), DW_AT_const_value(0x200)
	.dwattr $C$DW$293, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$293, DW_AT_decl_line(0x44)
	.dwattr $C$DW$293, DW_AT_decl_column(0x02)
$C$DW$294	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxIdError"), DW_AT_const_value(0x400)
	.dwattr $C$DW$294, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$294, DW_AT_decl_line(0x45)
	.dwattr $C$DW$294, DW_AT_decl_column(0x02)
$C$DW$295	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxLengthError"), DW_AT_const_value(0x800)
	.dwattr $C$DW$295, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$295, DW_AT_decl_line(0x46)
	.dwattr $C$DW$295, DW_AT_decl_column(0x02)
$C$DW$296	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxChecksumError"), DW_AT_const_value(0x1000)
	.dwattr $C$DW$296, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$296, DW_AT_decl_line(0x47)
	.dwattr $C$DW$296, DW_AT_decl_column(0x02)
	.dwendtag $C$DW$T$22

	.dwattr $C$DW$T$22, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
$C$DW$T$23	.dwtag  DW_TAG_typedef, DW_AT_name("UARTError")
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$23, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0x49)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x03)

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x13)
$C$DW$297	.dwtag  DW_TAG_member
	.dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$297, DW_AT_name("ID")
	.dwattr $C$DW$297, DW_AT_TI_symbol_name("ID")
	.dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$297, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$297, DW_AT_decl_line(0x52)
	.dwattr $C$DW$297, DW_AT_decl_column(0x07)
$C$DW$298	.dwtag  DW_TAG_member
	.dwattr $C$DW$298, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$298, DW_AT_name("torqueEnable")
	.dwattr $C$DW$298, DW_AT_TI_symbol_name("torqueEnable")
	.dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$298, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$298, DW_AT_decl_line(0x53)
	.dwattr $C$DW$298, DW_AT_decl_column(0x10)
$C$DW$299	.dwtag  DW_TAG_member
	.dwattr $C$DW$299, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$299, DW_AT_name("LED")
	.dwattr $C$DW$299, DW_AT_TI_symbol_name("LED")
	.dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$299, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$299, DW_AT_decl_line(0x54)
	.dwattr $C$DW$299, DW_AT_decl_column(0x10)
$C$DW$300	.dwtag  DW_TAG_member
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$300, DW_AT_name("cwComplianceMargin")
	.dwattr $C$DW$300, DW_AT_TI_symbol_name("cwComplianceMargin")
	.dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$300, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$300, DW_AT_decl_line(0x55)
	.dwattr $C$DW$300, DW_AT_decl_column(0x10)
$C$DW$301	.dwtag  DW_TAG_member
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$301, DW_AT_name("ccwComplianceMargin")
	.dwattr $C$DW$301, DW_AT_TI_symbol_name("ccwComplianceMargin")
	.dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$301, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$301, DW_AT_decl_line(0x56)
	.dwattr $C$DW$301, DW_AT_decl_column(0x10)
$C$DW$302	.dwtag  DW_TAG_member
	.dwattr $C$DW$302, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$302, DW_AT_name("cwComplianceSlope")
	.dwattr $C$DW$302, DW_AT_TI_symbol_name("cwComplianceSlope")
	.dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$302, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$302, DW_AT_decl_line(0x57)
	.dwattr $C$DW$302, DW_AT_decl_column(0x10)
$C$DW$303	.dwtag  DW_TAG_member
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$303, DW_AT_name("ccwComplianceSlope")
	.dwattr $C$DW$303, DW_AT_TI_symbol_name("ccwComplianceSlope")
	.dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$303, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$303, DW_AT_decl_line(0x58)
	.dwattr $C$DW$303, DW_AT_decl_column(0x10)
$C$DW$304	.dwtag  DW_TAG_member
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$304, DW_AT_name("goalPositionL")
	.dwattr $C$DW$304, DW_AT_TI_symbol_name("goalPositionL")
	.dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$304, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$304, DW_AT_decl_line(0x59)
	.dwattr $C$DW$304, DW_AT_decl_column(0x10)
$C$DW$305	.dwtag  DW_TAG_member
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$305, DW_AT_name("goalPositionH")
	.dwattr $C$DW$305, DW_AT_TI_symbol_name("goalPositionH")
	.dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$305, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$305, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$305, DW_AT_decl_column(0x10)
$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$306, DW_AT_name("movingSpeedL")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("movingSpeedL")
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$306, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$306, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$306, DW_AT_decl_column(0x10)
$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$307, DW_AT_name("movingSpeedH")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("movingSpeedH")
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$307, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$307, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$307, DW_AT_decl_column(0x10)
$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$308, DW_AT_name("torqueLimitL")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("torqueLimitL")
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$308, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$308, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$308, DW_AT_decl_column(0x10)
$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$309, DW_AT_name("torqueLimitH")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("torqueLimitH")
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$309, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$309, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$309, DW_AT_decl_column(0x10)
$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$310, DW_AT_name("presentPositionL")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("presentPositionL")
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$310, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$310, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$310, DW_AT_decl_column(0x10)
$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$311, DW_AT_name("presentPositionH")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("presentPositionH")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$311, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$311, DW_AT_decl_line(0x60)
	.dwattr $C$DW$311, DW_AT_decl_column(0x10)
$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$312, DW_AT_name("presentSpeedL")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("presentSpeedL")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$312, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$312, DW_AT_decl_line(0x61)
	.dwattr $C$DW$312, DW_AT_decl_column(0x10)
$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$313, DW_AT_name("presentSpeedH")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("presentSpeedH")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$313, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$313, DW_AT_decl_line(0x62)
	.dwattr $C$DW$313, DW_AT_decl_column(0x10)
$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$314, DW_AT_name("presentLoadL")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("presentLoadL")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$314, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$314, DW_AT_decl_line(0x63)
	.dwattr $C$DW$314, DW_AT_decl_column(0x10)
$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$315, DW_AT_name("presentLoadH")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("presentLoadH")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$315, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$315, DW_AT_decl_line(0x64)
	.dwattr $C$DW$315, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$21

	.dwattr $C$DW$T$21, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x51)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x0f)
$C$DW$T$28	.dwtag  DW_TAG_typedef, DW_AT_name("AX12")
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$28, DW_AT_decl_file("AX12.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0x65)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
$C$DW$T$29	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$29, DW_AT_address_class(0x20)
$C$DW$T$30	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)

$C$DW$T$31	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x156)
$C$DW$316	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$316, DW_AT_upper_bound(0x11)
	.dwendtag $C$DW$T$31

$C$DW$T$33	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$33, DW_AT_address_class(0x20)
$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")
$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
	.dwattr $C$DW$T$3, DW_AT_address_class(0x20)
$C$DW$T$35	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$2)
$C$DW$T$36	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$36, DW_AT_address_class(0x20)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$62	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$6)
$C$DW$T$63	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$63, DW_AT_address_class(0x20)
$C$DW$T$65	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$65, DW_AT_address_class(0x20)
$C$DW$T$69	.dwtag  DW_TAG_typedef, DW_AT_name("tBoolean")
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/AM335X_StarterWare_02_00_01_01/include/hw/hw_types.h")
	.dwattr $C$DW$T$69, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$69, DW_AT_decl_column(0x17)
$C$DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/AM335X_StarterWare_02_00_01_01/PRUCodeGenerationTools/include/stdint.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
$C$DW$T$24	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$24, DW_AT_address_class(0x20)
$C$DW$T$72	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$24)

$C$DW$T$75	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x02)
$C$DW$317	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$317, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$75


$C$DW$T$76	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
