;******************************************************************************
;* PRU C/C++ Codegen                                                PC v2.1.1 *
;* Date/Time created: Sat Jun 24 12:47:56 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_version=3 --symdebug:dwarf --symdebug:dwarf_version=3 

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("AXS1.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen PC v2.1.1 Copyright (c) 2012-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("D:\Programming\Robot\Bioloid\BioloidBeagleBone\BioloidBeaglebone\PRU_0")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("C:/ti/AM335X_StarterWare_02_00_01_01/PRUCodeGenerationTools/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x63)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)
$C$DW$3	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$3, DW_AT_type(*$C$DW$T$39)
$C$DW$4	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$4, DW_AT_type(*$C$DW$T$40)

	.dwattr $C$DW$381, DW_AT_TI_begin_file("AXS1.c")
	.dwattr $C$DW$381, DW_AT_TI_begin_line(0xb7)
	.dwattr $C$DW$381, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$381, DW_AT_decl_file("AXS1.c")
	.dwattr $C$DW$381, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$381, DW_AT_decl_column(0x06)
	.dwattr $C$DW$381, DW_AT_TI_max_frame_size(0x02)
	.dwpsn	file "AXS1.c",line 184,column 1,is_stmt,address ||AXS1GetBuzzerIndex||,isa 0

	.dwfde $C$DW$CIE, ||AXS1GetBuzzerIndex||
$C$DW$382	.dwtag  DW_TAG_formal_parameter, DW_AT_name("slot")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("slot")
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$382, DW_AT_location[DW_OP_regx 0x38]

;***************************************************************
;* FNAME: AXS1GetBuzzerIndex            FR SIZE:   2           *
;*                                                             *
;* FUNCTION ENVIRONMENT                                        *
;*                                                             *
;* FUNCTION PROPERTIES                                         *
;*                            0 Auto,  2 SOE     *
;***************************************************************

||AXS1GetBuzzerIndex||:
;* --------------------------------------------------------------------------*
;* r14_0 assigned to slot
$C$DW$383	.dwtag  DW_TAG_variable, DW_AT_name("slot")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("slot")
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$383, DW_AT_location[DW_OP_regx 0x38]
	.dwcfi	cfa_offset, 0
        SUB       r2, r2, 0x02          ; [] 
	.dwcfi	cfa_offset, 2
        SBBO      &r3.b2, r2, 0, 2      ; [] 
	.dwcfi	save_reg_to_mem, 14, -2
	.dwcfi	save_reg_to_mem, 15, -1
;*** 186	-----------------------    return *(slot*35+(struct $$fake0 *)&1$$+22);
	.dwpsn	file "AXS1.c",line 186,column 2,is_stmt,isa 0
        MOV       r14, r14.b0           ; [] |186| slot
        LDI       r15, 0x0023           ; [] |186| 
$C$DW$384	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$384, DW_AT_low_pc(0x00)
	.dwattr $C$DW$384, DW_AT_name("__pruabi_mpyi")
	.dwattr $C$DW$384, DW_AT_TI_call
        JAL       r3.w2, ||__pruabi_mpyi|| ; [] |186| __pruabi_mpyi
        LDI       r0, ||$O1$$||+22      ; [] |186| $O1$$
        LBBO      &r14.b0, r0, r14, 1   ; [] |186| 
        LBBO      &r3.b2, r2, 0, 2      ; [] 
	.dwcfi	restore_reg, 14
	.dwcfi	restore_reg, 15
        ADD       r2, r2, 0x02          ; [] 
	.dwcfi	cfa_offset, 0
$C$DW$385	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$385, DW_AT_low_pc(0x00)
	.dwattr $C$DW$385, DW_AT_TI_return
        JMP       r3.w2                 ; [] 
	.dwattr $C$DW$381, DW_AT_TI_end_file("AXS1.c")
	.dwattr $C$DW$381, DW_AT_TI_end_line(0xbc)
	.dwattr $C$DW$381, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$381

;* Inlined function references:
;* [ 56] AXS1SetSyncInfo
;*****************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                             *
;*****************************************************************************
	.global	||uartTxPacket||
	.global	||uartRxPacket||
	.global	||dynamixelsPing||
	.global	||dynamixelsIsType||
	.global	||__vla_alloc||
	.global	||__vla_dealloc||
	.global	||__pruabi_mpyi||
	.global	||memcpy||

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$24	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
$C$DW$386	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxNoError"), DW_AT_const_value(0x00)
	.dwattr $C$DW$386, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$386, DW_AT_decl_line(0x41)
	.dwattr $C$DW$386, DW_AT_decl_column(0x02)
$C$DW$387	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxGeneralError"), DW_AT_const_value(0x80)
	.dwattr $C$DW$387, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$387, DW_AT_decl_line(0x42)
	.dwattr $C$DW$387, DW_AT_decl_column(0x02)
$C$DW$388	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxTimeout"), DW_AT_const_value(0x100)
	.dwattr $C$DW$388, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$388, DW_AT_decl_line(0x43)
	.dwattr $C$DW$388, DW_AT_decl_column(0x02)
$C$DW$389	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxHeaderError"), DW_AT_const_value(0x200)
	.dwattr $C$DW$389, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$389, DW_AT_decl_line(0x44)
	.dwattr $C$DW$389, DW_AT_decl_column(0x02)
$C$DW$390	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxIdError"), DW_AT_const_value(0x400)
	.dwattr $C$DW$390, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$390, DW_AT_decl_line(0x45)
	.dwattr $C$DW$390, DW_AT_decl_column(0x02)
$C$DW$391	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxLengthError"), DW_AT_const_value(0x800)
	.dwattr $C$DW$391, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$391, DW_AT_decl_line(0x46)
	.dwattr $C$DW$391, DW_AT_decl_column(0x02)
$C$DW$392	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxChecksumError"), DW_AT_const_value(0x1000)
	.dwattr $C$DW$392, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$392, DW_AT_decl_line(0x47)
	.dwattr $C$DW$392, DW_AT_decl_column(0x02)
	.dwendtag $C$DW$T$24

	.dwattr $C$DW$T$24, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
$C$DW$T$25	.dwtag  DW_TAG_typedef, DW_AT_name("UARTError")
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$25, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x49)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x03)

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x23)
$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$393, DW_AT_name("ID")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("ID")
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$393, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$393, DW_AT_decl_line(0x38)
	.dwattr $C$DW$393, DW_AT_decl_column(0x07)
$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$394, DW_AT_name("obstacleDetectedCompareValue")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("obstacleDetectedCompareValue")
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$394, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$394, DW_AT_decl_line(0x39)
	.dwattr $C$DW$394, DW_AT_decl_column(0x10)
$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$395, DW_AT_name("lightDetectedCompareValue")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("lightDetectedCompareValue")
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$395, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$395, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$395, DW_AT_decl_column(0x10)
$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$396, DW_AT_name("reserved11")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("reserved11")
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$396, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$396, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$396, DW_AT_decl_column(0x10)
$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$397, DW_AT_name("reserved12")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("reserved12")
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$397, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$397, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$397, DW_AT_decl_column(0x10)
$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$398, DW_AT_name("reserved13")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("reserved13")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$398, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$398, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$398, DW_AT_decl_column(0x10)
$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$399, DW_AT_name("reserved14")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("reserved14")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$399, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$399, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$399, DW_AT_decl_column(0x10)
$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$400, DW_AT_name("leftIRSensorData")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("leftIRSensorData")
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$400, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$400, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$400, DW_AT_decl_column(0x10)
$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$401, DW_AT_name("centerIRSensorData")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("centerIRSensorData")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$401, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$401, DW_AT_decl_line(0x40)
	.dwattr $C$DW$401, DW_AT_decl_column(0x10)
$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$402, DW_AT_name("rightIRSensorData")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("rightIRSensorData")
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$402, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$402, DW_AT_decl_line(0x41)
	.dwattr $C$DW$402, DW_AT_decl_column(0x10)
$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$403, DW_AT_name("leftLuminosity")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("leftLuminosity")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$403, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$403, DW_AT_decl_line(0x42)
	.dwattr $C$DW$403, DW_AT_decl_column(0x10)
$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$404, DW_AT_name("centerLuminosity")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("centerLuminosity")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$404, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$404, DW_AT_decl_line(0x43)
	.dwattr $C$DW$404, DW_AT_decl_column(0x10)
$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$405, DW_AT_name("rightLuminosity")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("rightLuminosity")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$405, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$405, DW_AT_decl_line(0x44)
	.dwattr $C$DW$405, DW_AT_decl_column(0x10)
$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$406, DW_AT_name("obstacleDetectionFlag")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("obstacleDetectionFlag")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$406, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$406, DW_AT_decl_line(0x45)
	.dwattr $C$DW$406, DW_AT_decl_column(0x10)
$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$407, DW_AT_name("luminosityDetectionFlag")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("luminosityDetectionFlag")
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$407, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$407, DW_AT_decl_line(0x46)
	.dwattr $C$DW$407, DW_AT_decl_column(0x10)
$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$408, DW_AT_name("reserved15")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("reserved15")
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$408, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$408, DW_AT_decl_line(0x47)
	.dwattr $C$DW$408, DW_AT_decl_column(0x10)
$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$409, DW_AT_name("soundData")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("soundData")
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$409, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$409, DW_AT_decl_line(0x48)
	.dwattr $C$DW$409, DW_AT_decl_column(0x10)
$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$410, DW_AT_name("soundDataMaxHold")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("soundDataMaxHold")
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$410, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$410, DW_AT_decl_line(0x49)
	.dwattr $C$DW$410, DW_AT_decl_column(0x10)
$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$411, DW_AT_name("soundDetectedCount")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("soundDetectedCount")
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$411, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$411, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$411, DW_AT_decl_column(0x10)
$C$DW$412	.dwtag  DW_TAG_member
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$412, DW_AT_name("soundDetectedTimeL")
	.dwattr $C$DW$412, DW_AT_TI_symbol_name("soundDetectedTimeL")
	.dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$412, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$412, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$412, DW_AT_decl_column(0x10)
$C$DW$413	.dwtag  DW_TAG_member
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$413, DW_AT_name("soundDetectedTimeH")
	.dwattr $C$DW$413, DW_AT_TI_symbol_name("soundDetectedTimeH")
	.dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$413, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$413, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$413, DW_AT_decl_column(0x10)
$C$DW$414	.dwtag  DW_TAG_member
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$414, DW_AT_name("buzzerIndex")
	.dwattr $C$DW$414, DW_AT_TI_symbol_name("buzzerIndex")
	.dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$414, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$414, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$414, DW_AT_decl_column(0x10)
$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$415, DW_AT_name("buzzerTime")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("buzzerTime")
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$415, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$415, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$415, DW_AT_decl_column(0x10)
$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$416, DW_AT_name("presentVoltage")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("presentVoltage")
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$416, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$416, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$416, DW_AT_decl_column(0x10)
$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$417, DW_AT_name("presentTemperature")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("presentTemperature")
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$417, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$417, DW_AT_decl_line(0x50)
	.dwattr $C$DW$417, DW_AT_decl_column(0x10)
$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$418, DW_AT_name("registeredInstruction")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("registeredInstruction")
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$418, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$418, DW_AT_decl_line(0x51)
	.dwattr $C$DW$418, DW_AT_decl_column(0x10)
$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$419, DW_AT_name("reserved16")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("reserved16")
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$419, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$419, DW_AT_decl_line(0x52)
	.dwattr $C$DW$419, DW_AT_decl_column(0x10)
$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$420, DW_AT_name("irRemoconArrived")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("irRemoconArrived")
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$420, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$420, DW_AT_decl_line(0x53)
	.dwattr $C$DW$420, DW_AT_decl_column(0x10)
$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$421, DW_AT_name("lock")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("lock")
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$421, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$421, DW_AT_decl_line(0x54)
	.dwattr $C$DW$421, DW_AT_decl_column(0x10)
$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$422, DW_AT_name("irRemoconRXData0")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("irRemoconRXData0")
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$422, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$422, DW_AT_decl_line(0x55)
	.dwattr $C$DW$422, DW_AT_decl_column(0x10)
$C$DW$423	.dwtag  DW_TAG_member
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$423, DW_AT_name("irRemoconRXData1")
	.dwattr $C$DW$423, DW_AT_TI_symbol_name("irRemoconRXData1")
	.dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$423, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$423, DW_AT_decl_line(0x56)
	.dwattr $C$DW$423, DW_AT_decl_column(0x10)
$C$DW$424	.dwtag  DW_TAG_member
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$424, DW_AT_name("irRemoconTXData0")
	.dwattr $C$DW$424, DW_AT_TI_symbol_name("irRemoconTXData0")
	.dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$424, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$424, DW_AT_decl_line(0x57)
	.dwattr $C$DW$424, DW_AT_decl_column(0x10)
$C$DW$425	.dwtag  DW_TAG_member
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$425, DW_AT_name("irRemoconTXData1")
	.dwattr $C$DW$425, DW_AT_TI_symbol_name("irRemoconTXData1")
	.dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$425, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$425, DW_AT_decl_line(0x58)
	.dwattr $C$DW$425, DW_AT_decl_column(0x10)
$C$DW$426	.dwtag  DW_TAG_member
	.dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$426, DW_AT_name("obstacleDetectedCompare")
	.dwattr $C$DW$426, DW_AT_TI_symbol_name("obstacleDetectedCompare")
	.dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$426, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$426, DW_AT_decl_line(0x59)
	.dwattr $C$DW$426, DW_AT_decl_column(0x10)
$C$DW$427	.dwtag  DW_TAG_member
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$427, DW_AT_name("lightDetectedCompare")
	.dwattr $C$DW$427, DW_AT_TI_symbol_name("lightDetectedCompare")
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$427, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$427, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$427, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$21

	.dwattr $C$DW$T$21, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x37)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x0f)
$C$DW$T$30	.dwtag  DW_TAG_typedef, DW_AT_name("AXS1")
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$30, DW_AT_decl_file("AXS1.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
$C$DW$T$31	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$31, DW_AT_address_class(0x20)
$C$DW$T$32	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)

$C$DW$T$33	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x23)
$C$DW$428	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$428, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$33


$C$DW$T$22	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x23)
$C$DW$429	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$429, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$22

$C$DW$T$35	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$35, DW_AT_address_class(0x20)

$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_name(".ggroup1")
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x24)
$C$DW$430	.dwtag  DW_TAG_member
	.dwattr $C$DW$430, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$430, DW_AT_name("AXS1Count")
	.dwattr $C$DW$430, DW_AT_TI_symbol_name("AXS1Count")
	.dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$431	.dwtag  DW_TAG_member
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$431, DW_AT_name("AXS1s")
	.dwattr $C$DW$431, DW_AT_TI_symbol_name("AXS1s")
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$23

$C$DW$T$37	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$37, DW_AT_address_class(0x20)
$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")
$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
	.dwattr $C$DW$T$3, DW_AT_address_class(0x20)
$C$DW$T$38	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$2)
$C$DW$T$39	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$39, DW_AT_address_class(0x20)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$63	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$6)
$C$DW$T$64	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$64, DW_AT_address_class(0x20)
$C$DW$T$66	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$66, DW_AT_address_class(0x20)
$C$DW$T$69	.dwtag  DW_TAG_typedef, DW_AT_name("tBoolean")
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/AM335X_StarterWare_02_00_01_01/include/hw/hw_types.h")
	.dwattr $C$DW$T$69, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$69, DW_AT_decl_column(0x17)
$C$DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/AM335X_StarterWare_02_00_01_01/PRUCodeGenerationTools/include/stdint.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
$C$DW$T$26	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$26, DW_AT_address_class(0x20)
$C$DW$T$72	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$26)

$C$DW$T$75	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x02)
$C$DW$432	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$432, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$75

$C$DW$T$20	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
$C$DW$T$76	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$19)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x04)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
$C$DW$T$46	.dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
	.dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/AM335X_StarterWare_02_00_01_01/PRUCodeGenerationTools/include/stdint.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x1c)
$C$DW$T$80	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$46)
$C$DW$T$10	.dwtag  DW_TAG_base_type
