;******************************************************************************
;* PRU C/C++ Codegen                                                PC v2.1.1 *
;* Date/Time created: Sat Jun 24 12:47:57 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_version=3 --symdebug:dwarf --symdebug:dwarf_version=3 

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("motion.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen PC v2.1.1 Copyright (c) 2012-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("D:\Programming\Robot\Bioloid\BioloidBeagleBone\BioloidBeaglebone\PRU_0")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("abs")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("abs")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("C:/ti/AM335X_StarterWare_02_00_01_01/PRUCodeGenerationTools/include/stdlib.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x71)
	.dwattr $C$DW$1, DW_AT_decl_column(0x1d)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$10)
	.dwendtag $C$DW$1


$C$DW$3	.dwtag  DW_TAG_subprogram, DW_AT_name("__builtin_abs")
	.dwattr $C$DW$3, DW_AT_TI_symbol_name("__builtin_abs")

        JAL       r3.w2, ||AX12SetCCWComplianceSlope|| ; [] |60| AX12SetCCWComplianceSlope
;*** 61	-----------------------    AX12SetMovingSpeed(servoCount, 0u);
	.dwpsn	file "motion.c",line 61,column 3,is_stmt,isa 0
        MOV       r14.b0, r4.b1         ; [] |61| servoCount
        LDI       r14.w1, 0x0000        ; [] |61| 
$C$DW$267	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$267, DW_AT_low_pc(0x00)
	.dwattr $C$DW$267, DW_AT_name("AX12SetMovingSpeed")
	.dwattr $C$DW$267, DW_AT_TI_call
        JAL       r3.w2, ||AX12SetMovingSpeed|| ; [] |61| AX12SetMovingSpeed
;*** 62	-----------------------    AX12SetTorqueLimit(servoCount, 1023u);
	.dwpsn	file "motion.c",line 62,column 3,is_stmt,isa 0
        MOV       r14.b0, r4.b1         ; [] |62| servoCount
        LDI       r14.w1, 0x03ff        ; [] |62| 
$C$DW$268	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$268, DW_AT_low_pc(0x00)
	.dwattr $C$DW$268, DW_AT_name("AX12SetTorqueLimit")
	.dwattr $C$DW$268, DW_AT_TI_call
        JAL       r3.w2, ||AX12SetTorqueLimit|| ; [] |62| AX12SetTorqueLimit
;*** 56	-----------------------    if ( AX12sGetCount() > (++servoCount) ) goto g7;
	.dwpsn	file "motion.c",line 56,column 27,is_stmt,isa 0
$C$DW$269	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$269, DW_AT_low_pc(0x00)
	.dwattr $C$DW$269, DW_AT_name("AX12sGetCount")
	.dwattr $C$DW$269, DW_AT_TI_call
        JAL       r3.w2, ||AX12sGetCount|| ; [] |56| AX12sGetCount
        ADD       r4.b1, r4.b1, 0x01    ; [] |56| servoCount,servoCount
        QBGT      ||$C$L104||, r4.b1, r14.b0 ; [] |56| servoCount
;* --------------------------------------------------------------------------*
||$C$L105||:    
;***	-----------------------g8:
;*** 64	-----------------------    AX12SetSyncInfoAll(24u, 35u);
	.dwpsn	file "motion.c",line 64,column 2,is_stmt,isa 0
        LDI       r14.b0, 0x18          ; [] |64| 
        LDI       r14.b1, 0x23          ; [] |64| 
$C$DW$270	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$270, DW_AT_low_pc(0x00)
	.dwattr $C$DW$270, DW_AT_name("AX12SetSyncInfoAll")
	.dwattr $C$DW$270, DW_AT_TI_call
        JAL       r3.w2, ||AX12SetSyncInfoAll|| ; [] |64| AX12SetSyncInfoAll
;*** 65	-----------------------    *(K$1 = &scenePlaying) = K$25;
	.dwpsn	file "motion.c",line 65,column 2,is_stmt,isa 0
        LDI       r0, ||scenePlaying||  ; [] |65| $O$K1,scenePlaying
        SBBO      &r4.b0, r0, 0, 1      ; [] |65| $O$K1,$O$K25
;*** 67	-----------------------    return 1;
	.dwpsn	file "motion.c",line 67,column 2,is_stmt,isa 0
        LDI       r14.b0, 0x01          ; [] |67| 
;* --------------------------------------------------------------------------*
||$C$L106||:    
        LBBO      &r3.b2, r2, 0, 6      ; [] 
	.dwcfi	restore_reg, 14
	.dwcfi	restore_reg, 15
	.dwcfi	restore_reg, 16
	.dwcfi	restore_reg, 17
	.dwcfi	restore_reg, 18
	.dwcfi	restore_reg, 19
        ADD       r2, r2, 0x06          ; [] 
	.dwcfi	cfa_offset, 0
$C$DW$271	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$271, DW_AT_low_pc(0x00)
	.dwattr $C$DW$271, DW_AT_TI_return
        JMP       r3.w2                 ; [] 
	.dwattr $C$DW$252, DW_AT_TI_end_file("motion.c")
	.dwattr $C$DW$252, DW_AT_TI_end_line(0x45)
	.dwattr $C$DW$252, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$252

;* Inlined function references:
;* [  2] memset
;*****************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                             *
;*****************************************************************************
	.global	||AX12sGetCount||
	.global	||AX12GetID||
	.global	||AX12SetTorqueEnable||
	.global	||AX12SetCWComplianceSlope||
	.global	||AX12SetCCWComplianceSlope||
	.global	||AX12GetGoalPosition||
	.global	||AX12SetGoalPosition||
	.global	||AX12SetMovingSpeed||
	.global	||AX12SetTorqueLimit||
	.global	||AX12GetInfoAll||
	.global	||AX12SetSyncInfoAll||
	.global	||__pruabi_divi||
	.global	||__pruabi_mpyi||
	.global	||memcpy||

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$34	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
$C$DW$272	.dwtag  DW_TAG_enumerator, DW_AT_name("PRE_ACCELERATION_SECTION"), DW_AT_const_value(0x00)
	.dwattr $C$DW$272, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$272, DW_AT_decl_line(0x59)
	.dwattr $C$DW$272, DW_AT_decl_column(0x02)
$C$DW$273	.dwtag  DW_TAG_enumerator, DW_AT_name("MAIN_SECTION"), DW_AT_const_value(0x01)
	.dwattr $C$DW$273, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$273, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$273, DW_AT_decl_column(0x02)
$C$DW$274	.dwtag  DW_TAG_enumerator, DW_AT_name("POST_ACCELERATION_SECTION"), DW_AT_const_value(0x02)
	.dwattr $C$DW$274, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$274, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$274, DW_AT_decl_column(0x02)
$C$DW$275	.dwtag  DW_TAG_enumerator, DW_AT_name("PAUSE_SECTION"), DW_AT_const_value(0x03)
	.dwattr $C$DW$275, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$275, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$275, DW_AT_decl_column(0x02)
	.dwendtag $C$DW$T$34

	.dwattr $C$DW$T$34, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$T$34, DW_AT_decl_line(0x58)
	.dwattr $C$DW$T$34, DW_AT_decl_column(0x0d)
$C$DW$T$36	.dwtag  DW_TAG_typedef, DW_AT_name("sectionType")
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$36, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$T$36, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$T$36, DW_AT_decl_column(0x03)

$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x40)
$C$DW$276	.dwtag  DW_TAG_member
	.dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$276, DW_AT_name("name")
	.dwattr $C$DW$276, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$276, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$276, DW_AT_decl_line(0x32)
	.dwattr $C$DW$276, DW_AT_decl_column(0x07)
$C$DW$277	.dwtag  DW_TAG_member
	.dwattr $C$DW$277, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$277, DW_AT_name("unidentifiedByte0")
	.dwattr $C$DW$277, DW_AT_TI_symbol_name("unidentifiedByte0")
	.dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$277, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$277, DW_AT_decl_line(0x33)
	.dwattr $C$DW$277, DW_AT_decl_column(0x07)
$C$DW$278	.dwtag  DW_TAG_member
	.dwattr $C$DW$278, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$278, DW_AT_name("playCount")
	.dwattr $C$DW$278, DW_AT_TI_symbol_name("playCount")
	.dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$278, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$278, DW_AT_decl_line(0x34)
	.dwattr $C$DW$278, DW_AT_decl_column(0x07)
$C$DW$279	.dwtag  DW_TAG_member
	.dwattr $C$DW$279, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$279, DW_AT_name("schedule")
	.dwattr $C$DW$279, DW_AT_TI_symbol_name("schedule")
	.dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$279, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$279, DW_AT_decl_line(0x35)
	.dwattr $C$DW$279, DW_AT_decl_column(0x07)
$C$DW$280	.dwtag  DW_TAG_member
	.dwattr $C$DW$280, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$280, DW_AT_name("res1")
	.dwattr $C$DW$280, DW_AT_TI_symbol_name("res1")
	.dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$280, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$280, DW_AT_decl_line(0x36)
	.dwattr $C$DW$280, DW_AT_decl_column(0x07)
$C$DW$281	.dwtag  DW_TAG_member
	.dwattr $C$DW$281, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$281, DW_AT_name("poseCount")
	.dwattr $C$DW$281, DW_AT_TI_symbol_name("poseCount")
	.dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$281, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$281, DW_AT_decl_line(0x37)
	.dwattr $C$DW$281, DW_AT_decl_column(0x07)
$C$DW$282	.dwtag  DW_TAG_member
	.dwattr $C$DW$282, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$282, DW_AT_name("unidentifiedByte1")
	.dwattr $C$DW$282, DW_AT_TI_symbol_name("unidentifiedByte1")
	.dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$282, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$282, DW_AT_decl_line(0x38)
	.dwattr $C$DW$282, DW_AT_decl_column(0x07)
$C$DW$283	.dwtag  DW_TAG_member
	.dwattr $C$DW$283, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$283, DW_AT_name("pageSpeed")
	.dwattr $C$DW$283, DW_AT_TI_symbol_name("pageSpeed")
	.dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$283, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$283, DW_AT_decl_line(0x39)
	.dwattr $C$DW$283, DW_AT_decl_column(0x07)
$C$DW$284	.dwtag  DW_TAG_member
	.dwattr $C$DW$284, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$284, DW_AT_name("dxlSetup")
	.dwattr $C$DW$284, DW_AT_TI_symbol_name("dxlSetup")
	.dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$284, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$284, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$284, DW_AT_decl_column(0x07)
$C$DW$285	.dwtag  DW_TAG_member
	.dwattr $C$DW$285, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$285, DW_AT_name("accelTime")
	.dwattr $C$DW$285, DW_AT_TI_symbol_name("accelTime")
	.dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$285, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$285, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$285, DW_AT_decl_column(0x07)
$C$DW$286	.dwtag  DW_TAG_member
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$286, DW_AT_name("nextPage")
	.dwattr $C$DW$286, DW_AT_TI_symbol_name("nextPage")
	.dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$286, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$286, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$286, DW_AT_decl_column(0x07)
$C$DW$287	.dwtag  DW_TAG_member
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$287, DW_AT_name("exitPage")
	.dwattr $C$DW$287, DW_AT_TI_symbol_name("exitPage")
	.dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$287, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$287, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$287, DW_AT_decl_column(0x07)
$C$DW$288	.dwtag  DW_TAG_member
	.dwattr $C$DW$288, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$288, DW_AT_name("linkedPage1")
	.dwattr $C$DW$288, DW_AT_TI_symbol_name("linkedPage1")
	.dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$288, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$288, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$288, DW_AT_decl_column(0x07)
$C$DW$289	.dwtag  DW_TAG_member
	.dwattr $C$DW$289, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$289, DW_AT_name("linkedPage1PlayCode")
	.dwattr $C$DW$289, DW_AT_TI_symbol_name("linkedPage1PlayCode")
	.dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$289, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$289, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$289, DW_AT_decl_column(0x07)
$C$DW$290	.dwtag  DW_TAG_member
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$290, DW_AT_name("linkedPage2")
	.dwattr $C$DW$290, DW_AT_TI_symbol_name("linkedPage2")
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$290, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$290, DW_AT_decl_line(0x40)
	.dwattr $C$DW$290, DW_AT_decl_column(0x07)
$C$DW$291	.dwtag  DW_TAG_member
	.dwattr $C$DW$291, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$291, DW_AT_name("linkedPage2PlayCode")
	.dwattr $C$DW$291, DW_AT_TI_symbol_name("linkedPage2PlayCode")
	.dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$291, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$291, DW_AT_decl_line(0x41)
	.dwattr $C$DW$291, DW_AT_decl_column(0x07)
$C$DW$292	.dwtag  DW_TAG_member
	.dwattr $C$DW$292, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$292, DW_AT_name("checkSum")
	.dwattr $C$DW$292, DW_AT_TI_symbol_name("checkSum")
	.dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$292, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$292, DW_AT_decl_line(0x42)
	.dwattr $C$DW$292, DW_AT_decl_column(0x07)
$C$DW$293	.dwtag  DW_TAG_member
	.dwattr $C$DW$293, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$293, DW_AT_name("slope")
	.dwattr $C$DW$293, DW_AT_TI_symbol_name("slope")
	.dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$293, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$293, DW_AT_decl_line(0x43)
	.dwattr $C$DW$293, DW_AT_decl_column(0x07)
$C$DW$294	.dwtag  DW_TAG_member
	.dwattr $C$DW$294, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$294, DW_AT_name("unidentifiedByte2")
	.dwattr $C$DW$294, DW_AT_TI_symbol_name("unidentifiedByte2")
	.dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
	.dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$294, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$294, DW_AT_decl_line(0x44)
	.dwattr $C$DW$294, DW_AT_decl_column(0x07)
	.dwendtag $C$DW$T$24

	.dwattr $C$DW$T$24, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x31)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x0f)
$C$DW$T$28	.dwtag  DW_TAG_typedef, DW_AT_name("MOTION_PAGE_HEADER")
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$28, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0x45)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x03)

$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x40)
$C$DW$295	.dwtag  DW_TAG_member
	.dwattr $C$DW$295, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$295, DW_AT_name("posData")
	.dwattr $C$DW$295, DW_AT_TI_symbol_name("posData")
	.dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$295, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$295, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$295, DW_AT_decl_column(0x0b)
$C$DW$296	.dwtag  DW_TAG_member
	.dwattr $C$DW$296, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$296, DW_AT_name("delay")
	.dwattr $C$DW$296, DW_AT_TI_symbol_name("delay")
	.dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$296, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$296, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$296, DW_AT_decl_column(0x07)
$C$DW$297	.dwtag  DW_TAG_member
	.dwattr $C$DW$297, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$297, DW_AT_name("speed")
	.dwattr $C$DW$297, DW_AT_TI_symbol_name("speed")
	.dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$297, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$297, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$297, DW_AT_decl_column(0x07)
	.dwendtag $C$DW$T$27

	.dwattr $C$DW$T$27, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x0f)
$C$DW$T$29	.dwtag  DW_TAG_typedef, DW_AT_name("MOTION_POSE")
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$29, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x02)

$C$DW$T$30	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x1c0)
$C$DW$298	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$298, DW_AT_upper_bound(0x06)
	.dwendtag $C$DW$T$30


$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x200)
$C$DW$299	.dwtag  DW_TAG_member
	.dwattr $C$DW$299, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$299, DW_AT_name("header")
	.dwattr $C$DW$299, DW_AT_TI_symbol_name("header")
	.dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$299, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$299, DW_AT_decl_line(0x48)
	.dwattr $C$DW$299, DW_AT_decl_column(0x15)
$C$DW$300	.dwtag  DW_TAG_member
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$300, DW_AT_name("poses")
	.dwattr $C$DW$300, DW_AT_TI_symbol_name("poses")
	.dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$300, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$300, DW_AT_decl_line(0x49)
	.dwattr $C$DW$300, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$31

	.dwattr $C$DW$T$31, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x47)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x0f)
$C$DW$T$39	.dwtag  DW_TAG_typedef, DW_AT_name("MOTION_PAGE")
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$39, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x03)
$C$DW$T$40	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$40, DW_AT_address_class(0x20)
$C$DW$T$42	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$42, DW_AT_address_class(0x20)

$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
$C$DW$301	.dwtag  DW_TAG_member
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$301, DW_AT_name("startingPositionPlayingPose")
	.dwattr $C$DW$301, DW_AT_TI_symbol_name("startingPositionPlayingPose")
	.dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$301, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$301, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$301, DW_AT_decl_column(0x11)
$C$DW$302	.dwtag  DW_TAG_member
	.dwattr $C$DW$302, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$302, DW_AT_name("targetAnglePlayingPose")
	.dwattr $C$DW$302, DW_AT_TI_symbol_name("targetAnglePlayingPose")
	.dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$302, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$302, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$302, DW_AT_decl_column(0x14)
$C$DW$303	.dwtag  DW_TAG_member
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$303, DW_AT_name("totalPoseOffset")
	.dwattr $C$DW$303, DW_AT_TI_symbol_name("totalPoseOffset")
	.dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$303, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$303, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$303, DW_AT_decl_column(0x0f)
$C$DW$304	.dwtag  DW_TAG_member
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$304, DW_AT_name("mainSectionOffset")
	.dwattr $C$DW$304, DW_AT_TI_symbol_name("mainSectionOffset")
	.dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$304, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$304, DW_AT_decl_line(0x50)
	.dwattr $C$DW$304, DW_AT_decl_column(0x0f)
$C$DW$305	.dwtag  DW_TAG_member
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$305, DW_AT_name("accelerationSectionOffset")
	.dwattr $C$DW$305, DW_AT_TI_symbol_name("accelerationSectionOffset")
	.dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$305, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$305, DW_AT_decl_line(0x51)
	.dwattr $C$DW$305, DW_AT_decl_column(0x0f)
$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$306, DW_AT_name("movementUPU")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("movementUPU")
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$306, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$306, DW_AT_decl_line(0x52)
	.dwattr $C$DW$306, DW_AT_decl_column(0x0f)
$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$307, DW_AT_name("LastSectionCompletedUPU")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("LastSectionCompletedUPU")
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$307, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$307, DW_AT_decl_line(0x53)
	.dwattr $C$DW$307, DW_AT_decl_column(0x0f)
$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$308, DW_AT_name("inLoopRecordedUPU")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("inLoopRecordedUPU")
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$308, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$308, DW_AT_decl_line(0x54)
	.dwattr $C$DW$308, DW_AT_decl_column(0x0f)
$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$309, DW_AT_name("bpFinishType")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("bpFinishType")
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$309, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$309, DW_AT_decl_line(0x55)
	.dwattr $C$DW$309, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$32

	.dwattr $C$DW$T$32, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x0f)
$C$DW$T$45	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$45, DW_AT_address_class(0x20)
$C$DW$T$46	.dwtag  DW_TAG_typedef, DW_AT_name("motionComponents")
	.dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$46, DW_AT_decl_file("motion.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0x56)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x03)

$C$DW$T$47	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x20f)
$C$DW$310	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$310, DW_AT_upper_bound(0x1e)
	.dwendtag $C$DW$T$47


$C$DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$33, DW_AT_name(".ggroup1")
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x1c)
$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$311, DW_AT_name("currentPageIndex")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("currentPageIndex")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$312, DW_AT_name("currentPoseIndex")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("currentPoseIndex")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$313, DW_AT_name("currentTime")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("currentTime$2")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$314, DW_AT_name("sectionTime")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("sectionTime$3")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$315, DW_AT_name("pauseTime")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("pauseTime$4")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$316, DW_AT_name("TotalTime")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("TotalTime$5")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$317, DW_AT_name("acceleration")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("acceleration$6")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$318, DW_AT_name("nextPageIndex")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("nextPageIndex$8")
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$319, DW_AT_name("sceneInitialLoop")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("sceneInitialLoop")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$320, DW_AT_name("sceneFinished")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("sceneFinished")
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$321, DW_AT_name("sceneStop")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("sceneStop")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$322, DW_AT_name("bSection")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("bSection")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$323, DW_AT_name("pageRepeat")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("pageRepeat$7")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$33

$C$DW$T$48	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$48, DW_AT_address_class(0x20)
$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$67	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$6)
$C$DW$T$68	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$68, DW_AT_address_class(0x20)
$C$DW$T$69	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$69, DW_AT_address_class(0x20)
$C$DW$T$71	.dwtag  DW_TAG_typedef, DW_AT_name("tBoolean")
	.dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/AM335X_StarterWare_02_00_01_01/include/hw/hw_types.h")
	.dwattr $C$DW$T$71, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$71, DW_AT_decl_column(0x17)
$C$DW$T$75	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$71)
$C$DW$T$21	.dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/AM335X_StarterWare_02_00_01_01/PRUCodeGenerationTools/include/stdint.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x1c)

$C$DW$T$22	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x03)
$C$DW$324	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$324, DW_AT_upper_bound(0x02)
	.dwendtag $C$DW$T$22


$C$DW$T$23	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x1f)
$C$DW$325	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$325, DW_AT_upper_bound(0x1e)
	.dwendtag $C$DW$T$23


$C$DW$T$78	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x400)
$C$DW$326	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$326, DW_AT_upper_bound(0x3ff)
	.dwendtag $C$DW$T$78

$C$DW$T$79	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$21)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x04)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
$C$DW$T$80	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$80, DW_AT_address_class(0x20)
$C$DW$T$53	.dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/AM335X_StarterWare_02_00_01_01/PRUCodeGenerationTools/include/stdint.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x1d)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
