;******************************************************************************
;* PRU C/C++ Codegen                                                PC v2.1.1 *
;* Date/Time created: Sat Jun 24 12:47:56 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_version=3 --symdebug:dwarf --symdebug:dwarf_version=3 

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("uart.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen PC v2.1.1 Copyright (c) 2012-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("D:\Programming\Robot\Bioloid\BioloidBeagleBone\BioloidBeaglebone\PRU_0")
	.global	__PRU_CREG_PRU_UART
	.noinit	".TI.noinit"
	.weak	||CT_UART||
||CT_UART||:	.usect	".creg.PRU_UART.noload.near",56,1
$C$DW$1	.dwtag  DW_TAG_variable, DW_AT_name("CT_UART")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("CT_UART")
	.dwattr $C$DW$1, DW_AT_location[DW_OP_addr ||CT_UART||]
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$1, DW_AT_decl_column(0x18)
	.global	||g_DDRUart||
||g_DDRUart||:	.usect	".TI.noinit",4,1
$C$DW$2	.dwtag  DW_TAG_variable, DW_AT_name("g_DDRUart")

        LBCO      &r1, __PRU_CREG_PRU_UART, $CSBREL(||CT_UART||+12), 4 ; [] |62| CT_UART
        CLR       r1, r1, 0x00000007    ; [] |62| 
        SBCO      &r1, __PRU_CREG_PRU_UART, $CSBREL(||CT_UART||+12), 4 ; [] |62| CT_UART
;*** 63	-----------------------    *(&CT_UART+12) &= 0xffffffbfu;
	.dwpsn	file "uart.c",line 63,column 2,is_stmt,isa 0
        LBCO      &r1, __PRU_CREG_PRU_UART, $CSBREL(||CT_UART||+12), 4 ; [] |63| CT_UART
        CLR       r1, r1, 0x00000006    ; [] |63| 
        SBCO      &r1, __PRU_CREG_PRU_UART, $CSBREL(||CT_UART||+12), 4 ; [] |63| CT_UART
;*** 64	-----------------------    *(&CT_UART+12) &= 0xffffffdfu;
	.dwpsn	file "uart.c",line 64,column 2,is_stmt,isa 0
        LBCO      &r1, __PRU_CREG_PRU_UART, $CSBREL(||CT_UART||+12), 4 ; [] |64| CT_UART
        CLR       r1, r1, 0x00000005    ; [] |64| 
        SBCO      &r1, __PRU_CREG_PRU_UART, $CSBREL(||CT_UART||+12), 4 ; [] |64| CT_UART
;*** 65	-----------------------    *(&CT_UART+12) &= 0xffffffefu;
	.dwpsn	file "uart.c",line 65,column 2,is_stmt,isa 0
        LBCO      &r1, __PRU_CREG_PRU_UART, $CSBREL(||CT_UART||+12), 4 ; [] |65| CT_UART
        CLR       r1, r1, 0x00000004    ; [] |65| 
        SBCO      &r1, __PRU_CREG_PRU_UART, $CSBREL(||CT_UART||+12), 4 ; [] |65| CT_UART
;*** 66	-----------------------    *(&CT_UART+12) &= 0xfffffff7u;
	.dwpsn	file "uart.c",line 66,column 2,is_stmt,isa 0
        LBCO      &r1, __PRU_CREG_PRU_UART, $CSBREL(||CT_UART||+12), 4 ; [] |66| CT_UART
        CLR       r1, r1, 0x00000003    ; [] |66| 
        SBCO      &r1, __PRU_CREG_PRU_UART, $CSBREL(||CT_UART||+12), 4 ; [] |66| CT_UART
;*** 67	-----------------------    *(&CT_UART+12) &= 0xfffffffbu;
	.dwpsn	file "uart.c",line 67,column 2,is_stmt,isa 0
        LBCO      &r1, __PRU_CREG_PRU_UART, $CSBREL(||CT_UART||+12), 4 ; [] |67| CT_UART
        CLR       r1, r1, 0x00000002    ; [] |67| 
        SBCO      &r1, __PRU_CREG_PRU_UART, $CSBREL(||CT_UART||+12), 4 ; [] |67| CT_UART
;*** 71	-----------------------    *((volatile struct $$fake14 *)C$1+48) |= 1u;
	.dwpsn	file "uart.c",line 71,column 2,is_stmt,isa 0
        LBBO      &r1, r0, 48, 4        ; [] |71| $O$C1
        SET       r1, r1, 0x00000000    ; [] |71| 
        SBBO      &r1, r0, 48, 4        ; [] |71| $O$C1
;*** 72	-----------------------    *(&CT_UART+48) |= 0x2000u;
	.dwpsn	file "uart.c",line 72,column 2,is_stmt,isa 0
        LBCO      &r0, __PRU_CREG_PRU_UART, $CSBREL(||CT_UART||+48), 4 ; [] |72| CT_UART
        SET       r0, r0, 0x0000000d    ; [] |72| 
        SBCO      &r0, __PRU_CREG_PRU_UART, $CSBREL(||CT_UART||+48), 4 ; [] |72| CT_UART
;*** 73	-----------------------    *(&CT_UART+48) |= 0x4000u;
	.dwpsn	file "uart.c",line 73,column 2,is_stmt,isa 0
        LBCO      &r0, __PRU_CREG_PRU_UART, $CSBREL(||CT_UART||+48), 4 ; [] |73| CT_UART
        SET       r0, r0, 0x0000000e    ; [] |73| 
        SBCO      &r0, __PRU_CREG_PRU_UART, $CSBREL(||CT_UART||+48), 4 ; [] |73| CT_UART
;***  	-----------------------    return;
$C$DW$83	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$83, DW_AT_low_pc(0x00)
	.dwattr $C$DW$83, DW_AT_TI_return
        JMP       r3.w2                 ; [] 
	.dwattr $C$DW$81, DW_AT_TI_end_file("uart.c")
	.dwattr $C$DW$81, DW_AT_TI_end_line(0x4b)
	.dwattr $C$DW$81, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$81


;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$72	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$72, DW_AT_byte_size(0x02)
$C$DW$84	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxNoError"), DW_AT_const_value(0x00)
	.dwattr $C$DW$84, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$84, DW_AT_decl_line(0x41)
	.dwattr $C$DW$84, DW_AT_decl_column(0x02)
$C$DW$85	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxGeneralError"), DW_AT_const_value(0x80)
	.dwattr $C$DW$85, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$85, DW_AT_decl_line(0x42)
	.dwattr $C$DW$85, DW_AT_decl_column(0x02)
$C$DW$86	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxTimeout"), DW_AT_const_value(0x100)
	.dwattr $C$DW$86, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$86, DW_AT_decl_line(0x43)
	.dwattr $C$DW$86, DW_AT_decl_column(0x02)
$C$DW$87	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxHeaderError"), DW_AT_const_value(0x200)
	.dwattr $C$DW$87, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$87, DW_AT_decl_line(0x44)
	.dwattr $C$DW$87, DW_AT_decl_column(0x02)
$C$DW$88	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxIdError"), DW_AT_const_value(0x400)
	.dwattr $C$DW$88, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$88, DW_AT_decl_line(0x45)
	.dwattr $C$DW$88, DW_AT_decl_column(0x02)
$C$DW$89	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxLengthError"), DW_AT_const_value(0x800)
	.dwattr $C$DW$89, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$89, DW_AT_decl_line(0x46)
	.dwattr $C$DW$89, DW_AT_decl_column(0x02)
$C$DW$90	.dwtag  DW_TAG_enumerator, DW_AT_name("UARTRxChecksumError"), DW_AT_const_value(0x1000)
	.dwattr $C$DW$90, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$90, DW_AT_decl_line(0x47)
	.dwattr $C$DW$90, DW_AT_decl_column(0x02)
	.dwendtag $C$DW$T$72

	.dwattr $C$DW$T$72, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$T$72, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$T$72, DW_AT_decl_column(0x01)
$C$DW$T$73	.dwtag  DW_TAG_typedef, DW_AT_name("UARTError")
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$73, DW_AT_decl_file("uart.h")
	.dwattr $C$DW$T$73, DW_AT_decl_line(0x49)
	.dwattr $C$DW$T$73, DW_AT_decl_column(0x03)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
$C$DW$91	.dwtag  DW_TAG_member
	.dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$91, DW_AT_name("DATA")
	.dwattr $C$DW$91, DW_AT_TI_symbol_name("DATA")
	.dwattr $C$DW$91, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
	.dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$91, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$91, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$91, DW_AT_decl_column(0x0e)
$C$DW$92	.dwtag  DW_TAG_member
	.dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$92, DW_AT_name("rsvd8")
	.dwattr $C$DW$92, DW_AT_TI_symbol_name("rsvd8")
	.dwattr $C$DW$92, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
	.dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$92, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$92, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$92, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
$C$DW$T$38	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$19)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
$C$DW$93	.dwtag  DW_TAG_member
	.dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$93, DW_AT_name("DATA")
	.dwattr $C$DW$93, DW_AT_TI_symbol_name("DATA")
	.dwattr $C$DW$93, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
	.dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$93, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$93, DW_AT_decl_line(0x45)
	.dwattr $C$DW$93, DW_AT_decl_column(0x0e)
$C$DW$94	.dwtag  DW_TAG_member
	.dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$94, DW_AT_name("rsvd8")
	.dwattr $C$DW$94, DW_AT_TI_symbol_name("rsvd8")
	.dwattr $C$DW$94, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
	.dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$94, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$94, DW_AT_decl_line(0x46)
	.dwattr $C$DW$94, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0x44)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
$C$DW$T$40	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$20)

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
$C$DW$95	.dwtag  DW_TAG_member
	.dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$95, DW_AT_name("ERBI")
	.dwattr $C$DW$95, DW_AT_TI_symbol_name("ERBI")
	.dwattr $C$DW$95, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$95, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$95, DW_AT_decl_line(0x58)
	.dwattr $C$DW$95, DW_AT_decl_column(0x0d)
$C$DW$96	.dwtag  DW_TAG_member
	.dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$96, DW_AT_name("ETBEI")
	.dwattr $C$DW$96, DW_AT_TI_symbol_name("ETBEI")
	.dwattr $C$DW$96, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$96, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$96, DW_AT_decl_line(0x59)
	.dwattr $C$DW$96, DW_AT_decl_column(0x0d)
$C$DW$97	.dwtag  DW_TAG_member
	.dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$97, DW_AT_name("ELSI")
	.dwattr $C$DW$97, DW_AT_TI_symbol_name("ELSI")
	.dwattr $C$DW$97, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$97, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$97, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$97, DW_AT_decl_column(0x0d)
$C$DW$98	.dwtag  DW_TAG_member
	.dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$98, DW_AT_name("EDSSI")
	.dwattr $C$DW$98, DW_AT_TI_symbol_name("EDSSI")
	.dwattr $C$DW$98, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$98, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$98, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$98, DW_AT_decl_column(0x0d)
$C$DW$99	.dwtag  DW_TAG_member
	.dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$99, DW_AT_name("rsvd4")
	.dwattr $C$DW$99, DW_AT_TI_symbol_name("rsvd4")
	.dwattr $C$DW$99, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
	.dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$99, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$99, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$99, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$21

	.dwattr $C$DW$T$21, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x57)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x12)
$C$DW$T$43	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$21)

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
$C$DW$100	.dwtag  DW_TAG_member
	.dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$100, DW_AT_name("IPEND")
	.dwattr $C$DW$100, DW_AT_TI_symbol_name("IPEND")
	.dwattr $C$DW$100, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$100, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$100, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$100, DW_AT_decl_column(0x0e)
$C$DW$101	.dwtag  DW_TAG_member
	.dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$101, DW_AT_name("INTID")
	.dwattr $C$DW$101, DW_AT_TI_symbol_name("INTID")
	.dwattr $C$DW$101, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x03)
	.dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$101, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$101, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$101, DW_AT_decl_column(0x0e)
$C$DW$102	.dwtag  DW_TAG_member
	.dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$102, DW_AT_name("rsvd4")
	.dwattr $C$DW$102, DW_AT_TI_symbol_name("rsvd4")
	.dwattr $C$DW$102, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x02)
	.dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$102, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$102, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$102, DW_AT_decl_column(0x0e)
$C$DW$103	.dwtag  DW_TAG_member
	.dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$103, DW_AT_name("FIFOEN")
	.dwattr $C$DW$103, DW_AT_TI_symbol_name("FIFOEN")
	.dwattr $C$DW$103, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x02)
	.dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$103, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$103, DW_AT_decl_line(0x70)
	.dwattr $C$DW$103, DW_AT_decl_column(0x0e)
$C$DW$104	.dwtag  DW_TAG_member
	.dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$104, DW_AT_name("rsvd8")
	.dwattr $C$DW$104, DW_AT_TI_symbol_name("rsvd8")
	.dwattr $C$DW$104, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
	.dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$104, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$104, DW_AT_decl_line(0x71)
	.dwattr $C$DW$104, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$22

	.dwattr $C$DW$T$22, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
$C$DW$T$45	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$22)

$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
$C$DW$105	.dwtag  DW_TAG_member
	.dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$105, DW_AT_name("FIFOEN")
	.dwattr $C$DW$105, DW_AT_TI_symbol_name("FIFOEN")
	.dwattr $C$DW$105, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$105, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$105, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$105, DW_AT_decl_column(0x0e)
$C$DW$106	.dwtag  DW_TAG_member
	.dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$106, DW_AT_name("RXCLR")
	.dwattr $C$DW$106, DW_AT_TI_symbol_name("RXCLR")
	.dwattr $C$DW$106, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$106, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$106, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$106, DW_AT_decl_column(0x0e)
$C$DW$107	.dwtag  DW_TAG_member
	.dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$107, DW_AT_name("TXCLR")
	.dwattr $C$DW$107, DW_AT_TI_symbol_name("TXCLR")
	.dwattr $C$DW$107, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$107, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$107, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$107, DW_AT_decl_column(0x0e)
$C$DW$108	.dwtag  DW_TAG_member
	.dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$108, DW_AT_name("DMAMODE1")
	.dwattr $C$DW$108, DW_AT_TI_symbol_name("DMAMODE1")
	.dwattr $C$DW$108, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$108, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$108, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$108, DW_AT_decl_column(0x0e)
$C$DW$109	.dwtag  DW_TAG_member
	.dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$109, DW_AT_name("rsvd4")
	.dwattr $C$DW$109, DW_AT_TI_symbol_name("rsvd4")
	.dwattr $C$DW$109, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x02)
	.dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$109, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$109, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$109, DW_AT_decl_column(0x0e)
$C$DW$110	.dwtag  DW_TAG_member
	.dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$110, DW_AT_name("RXFIFTL")
	.dwattr $C$DW$110, DW_AT_TI_symbol_name("RXFIFTL")
	.dwattr $C$DW$110, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x02)
	.dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$110, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$110, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$110, DW_AT_decl_column(0x0e)
$C$DW$111	.dwtag  DW_TAG_member
	.dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$111, DW_AT_name("rsvd8")
	.dwattr $C$DW$111, DW_AT_TI_symbol_name("rsvd8")
	.dwattr $C$DW$111, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
	.dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$111, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$111, DW_AT_decl_line(0x80)
	.dwattr $C$DW$111, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$23

	.dwattr $C$DW$T$23, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0x79)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
$C$DW$T$47	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$23)

$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
$C$DW$112	.dwtag  DW_TAG_member
	.dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$112, DW_AT_name("WLS")
	.dwattr $C$DW$112, DW_AT_TI_symbol_name("WLS")
	.dwattr $C$DW$112, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
	.dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$112, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$112, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$112, DW_AT_decl_column(0x0d)
$C$DW$113	.dwtag  DW_TAG_member
	.dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$113, DW_AT_name("STB")
	.dwattr $C$DW$113, DW_AT_TI_symbol_name("STB")
	.dwattr $C$DW$113, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$113, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$113, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$113, DW_AT_decl_column(0x0d)
$C$DW$114	.dwtag  DW_TAG_member
	.dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$114, DW_AT_name("PEN")
	.dwattr $C$DW$114, DW_AT_TI_symbol_name("PEN")
	.dwattr $C$DW$114, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$114, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$114, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$114, DW_AT_decl_column(0x0d)
$C$DW$115	.dwtag  DW_TAG_member
	.dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$115, DW_AT_name("EPS")
	.dwattr $C$DW$115, DW_AT_TI_symbol_name("EPS")
	.dwattr $C$DW$115, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$115, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$115, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$115, DW_AT_decl_column(0x0d)
$C$DW$116	.dwtag  DW_TAG_member
	.dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$116, DW_AT_name("SP")
	.dwattr $C$DW$116, DW_AT_TI_symbol_name("SP")
	.dwattr $C$DW$116, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$116, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$116, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$116, DW_AT_decl_column(0x0d)
$C$DW$117	.dwtag  DW_TAG_member
	.dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$117, DW_AT_name("BC")
	.dwattr $C$DW$117, DW_AT_TI_symbol_name("BC")
	.dwattr $C$DW$117, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
	.dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$117, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$117, DW_AT_decl_line(0x90)
	.dwattr $C$DW$117, DW_AT_decl_column(0x0d)
$C$DW$118	.dwtag  DW_TAG_member
	.dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$118, DW_AT_name("DLAB")
	.dwattr $C$DW$118, DW_AT_TI_symbol_name("DLAB")
	.dwattr $C$DW$118, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
	.dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$118, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$118, DW_AT_decl_line(0x91)
	.dwattr $C$DW$118, DW_AT_decl_column(0x0d)
$C$DW$119	.dwtag  DW_TAG_member
	.dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$119, DW_AT_name("rsvd8")
	.dwattr $C$DW$119, DW_AT_TI_symbol_name("rsvd8")
	.dwattr $C$DW$119, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
	.dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$119, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$119, DW_AT_decl_line(0x92)
	.dwattr $C$DW$119, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$24

	.dwattr $C$DW$T$24, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x12)
$C$DW$T$50	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$24)

$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
$C$DW$120	.dwtag  DW_TAG_member
	.dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$120, DW_AT_name("rsvd0")
	.dwattr $C$DW$120, DW_AT_TI_symbol_name("rsvd0")
	.dwattr $C$DW$120, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$120, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$120, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$120, DW_AT_decl_column(0x0d)
$C$DW$121	.dwtag  DW_TAG_member
	.dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$121, DW_AT_name("RTS")
	.dwattr $C$DW$121, DW_AT_TI_symbol_name("RTS")
	.dwattr $C$DW$121, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$121, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$121, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$121, DW_AT_decl_column(0x0d)
$C$DW$122	.dwtag  DW_TAG_member
	.dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$122, DW_AT_name("OUT1")
	.dwattr $C$DW$122, DW_AT_TI_symbol_name("OUT1")
	.dwattr $C$DW$122, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$122, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$122, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$122, DW_AT_decl_column(0x0d)
$C$DW$123	.dwtag  DW_TAG_member
	.dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$123, DW_AT_name("OUT2")
	.dwattr $C$DW$123, DW_AT_TI_symbol_name("OUT2")
	.dwattr $C$DW$123, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$123, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$123, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$123, DW_AT_decl_column(0x0d)
$C$DW$124	.dwtag  DW_TAG_member
	.dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$124, DW_AT_name("LOOP")
	.dwattr $C$DW$124, DW_AT_TI_symbol_name("LOOP")
	.dwattr $C$DW$124, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$124, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$124, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$124, DW_AT_decl_column(0x0d)
$C$DW$125	.dwtag  DW_TAG_member
	.dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$125, DW_AT_name("AFE")
	.dwattr $C$DW$125, DW_AT_TI_symbol_name("AFE")
	.dwattr $C$DW$125, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$125, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$125, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$125, DW_AT_decl_column(0x0d)
$C$DW$126	.dwtag  DW_TAG_member
	.dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$126, DW_AT_name("rsvd8")
	.dwattr $C$DW$126, DW_AT_TI_symbol_name("rsvd8")
	.dwattr $C$DW$126, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
	.dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$126, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$126, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$126, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$25

	.dwattr $C$DW$T$25, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x12)
$C$DW$T$52	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$25)

$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
$C$DW$127	.dwtag  DW_TAG_member
	.dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$127, DW_AT_name("DR")
	.dwattr $C$DW$127, DW_AT_TI_symbol_name("DR")
	.dwattr $C$DW$127, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$127, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$127, DW_AT_decl_line(0xac)
	.dwattr $C$DW$127, DW_AT_decl_column(0x0d)
$C$DW$128	.dwtag  DW_TAG_member
	.dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$128, DW_AT_name("OE")
	.dwattr $C$DW$128, DW_AT_TI_symbol_name("OE")
	.dwattr $C$DW$128, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$128, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$128, DW_AT_decl_line(0xad)
	.dwattr $C$DW$128, DW_AT_decl_column(0x0d)
$C$DW$129	.dwtag  DW_TAG_member
	.dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$129, DW_AT_name("PE")
	.dwattr $C$DW$129, DW_AT_TI_symbol_name("PE")
	.dwattr $C$DW$129, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$129, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$129, DW_AT_decl_line(0xae)
	.dwattr $C$DW$129, DW_AT_decl_column(0x0d)
$C$DW$130	.dwtag  DW_TAG_member
	.dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$130, DW_AT_name("FE")
	.dwattr $C$DW$130, DW_AT_TI_symbol_name("FE")
	.dwattr $C$DW$130, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$130, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$130, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$130, DW_AT_decl_column(0x0d)
$C$DW$131	.dwtag  DW_TAG_member
	.dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$131, DW_AT_name("BI")
	.dwattr $C$DW$131, DW_AT_TI_symbol_name("BI")
	.dwattr $C$DW$131, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$131, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$131, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$131, DW_AT_decl_column(0x0d)
$C$DW$132	.dwtag  DW_TAG_member
	.dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$132, DW_AT_name("THRE")
	.dwattr $C$DW$132, DW_AT_TI_symbol_name("THRE")
	.dwattr $C$DW$132, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$132, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$132, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$132, DW_AT_decl_column(0x0d)
$C$DW$133	.dwtag  DW_TAG_member
	.dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$133, DW_AT_name("TEMT")
	.dwattr $C$DW$133, DW_AT_TI_symbol_name("TEMT")
	.dwattr $C$DW$133, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
	.dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$133, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$133, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$133, DW_AT_decl_column(0x0d)
$C$DW$134	.dwtag  DW_TAG_member
	.dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$134, DW_AT_name("RXFIFOE")
	.dwattr $C$DW$134, DW_AT_TI_symbol_name("RXFIFOE")
	.dwattr $C$DW$134, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
	.dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$134, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$134, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$134, DW_AT_decl_column(0x0d)
$C$DW$135	.dwtag  DW_TAG_member
	.dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$135, DW_AT_name("rsvd8")
	.dwattr $C$DW$135, DW_AT_TI_symbol_name("rsvd8")
	.dwattr $C$DW$135, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
	.dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$135, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$135, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$135, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$26

	.dwattr $C$DW$T$26, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0xab)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x12)
$C$DW$T$54	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$26)

$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
$C$DW$136	.dwtag  DW_TAG_member
	.dwattr $C$DW$136, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$136, DW_AT_name("DCTS")
	.dwattr $C$DW$136, DW_AT_TI_symbol_name("DCTS")
	.dwattr $C$DW$136, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$136, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$136, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$136, DW_AT_decl_column(0x0d)
$C$DW$137	.dwtag  DW_TAG_member
	.dwattr $C$DW$137, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$137, DW_AT_name("DDSR")
	.dwattr $C$DW$137, DW_AT_TI_symbol_name("DDSR")
	.dwattr $C$DW$137, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$137, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$137, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$137, DW_AT_decl_column(0x0d)
$C$DW$138	.dwtag  DW_TAG_member
	.dwattr $C$DW$138, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$138, DW_AT_name("TERI")
	.dwattr $C$DW$138, DW_AT_TI_symbol_name("TERI")
	.dwattr $C$DW$138, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$138, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$138, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$138, DW_AT_decl_column(0x0d)
$C$DW$139	.dwtag  DW_TAG_member
	.dwattr $C$DW$139, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$139, DW_AT_name("DCD")
	.dwattr $C$DW$139, DW_AT_TI_symbol_name("DCD")
	.dwattr $C$DW$139, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$139, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$139, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$139, DW_AT_decl_column(0x0d)
$C$DW$140	.dwtag  DW_TAG_member
	.dwattr $C$DW$140, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$140, DW_AT_name("CTS")
	.dwattr $C$DW$140, DW_AT_TI_symbol_name("CTS")
	.dwattr $C$DW$140, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$140, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$140, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$140, DW_AT_decl_column(0x0d)
$C$DW$141	.dwtag  DW_TAG_member
	.dwattr $C$DW$141, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$141, DW_AT_name("DSR")
	.dwattr $C$DW$141, DW_AT_TI_symbol_name("DSR")
	.dwattr $C$DW$141, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$141, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$141, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$141, DW_AT_decl_column(0x0d)
$C$DW$142	.dwtag  DW_TAG_member
	.dwattr $C$DW$142, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$142, DW_AT_name("RI")
	.dwattr $C$DW$142, DW_AT_TI_symbol_name("RI")
	.dwattr $C$DW$142, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
	.dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$142, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$142, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$142, DW_AT_decl_column(0x0d)
$C$DW$143	.dwtag  DW_TAG_member
	.dwattr $C$DW$143, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$143, DW_AT_name("CD")
	.dwattr $C$DW$143, DW_AT_TI_symbol_name("CD")
	.dwattr $C$DW$143, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
	.dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$143, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$143, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$143, DW_AT_decl_column(0x0d)
$C$DW$144	.dwtag  DW_TAG_member
	.dwattr $C$DW$144, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$144, DW_AT_name("rsvd8")
	.dwattr $C$DW$144, DW_AT_TI_symbol_name("rsvd8")
	.dwattr $C$DW$144, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
	.dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$144, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$144, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$144, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$27

	.dwattr $C$DW$T$27, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x12)
$C$DW$T$56	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$27)

$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
$C$DW$145	.dwtag  DW_TAG_member
	.dwattr $C$DW$145, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$145, DW_AT_name("SCR")
	.dwattr $C$DW$145, DW_AT_TI_symbol_name("SCR")
	.dwattr $C$DW$145, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
	.dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$145, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$145, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$145, DW_AT_decl_column(0x0d)
$C$DW$146	.dwtag  DW_TAG_member
	.dwattr $C$DW$146, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$146, DW_AT_name("rsvd8")
	.dwattr $C$DW$146, DW_AT_TI_symbol_name("rsvd8")
	.dwattr $C$DW$146, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
	.dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$146, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$146, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$146, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$28

	.dwattr $C$DW$T$28, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x12)
$C$DW$T$58	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$28)

$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
$C$DW$147	.dwtag  DW_TAG_member
	.dwattr $C$DW$147, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$147, DW_AT_name("DLL")
	.dwattr $C$DW$147, DW_AT_TI_symbol_name("DLL")
	.dwattr $C$DW$147, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
	.dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$147, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$147, DW_AT_decl_line(0xdb)
	.dwattr $C$DW$147, DW_AT_decl_column(0x0d)
$C$DW$148	.dwtag  DW_TAG_member
	.dwattr $C$DW$148, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$148, DW_AT_name("rsvd8")
	.dwattr $C$DW$148, DW_AT_TI_symbol_name("rsvd8")
	.dwattr $C$DW$148, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
	.dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$148, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$148, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$148, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$29

	.dwattr $C$DW$T$29, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0xda)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x12)
$C$DW$T$60	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$29)

$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
$C$DW$149	.dwtag  DW_TAG_member
	.dwattr $C$DW$149, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$149, DW_AT_name("DLH")
	.dwattr $C$DW$149, DW_AT_TI_symbol_name("DLH")
	.dwattr $C$DW$149, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
	.dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$149, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$149, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$149, DW_AT_decl_column(0x0d)
$C$DW$150	.dwtag  DW_TAG_member
	.dwattr $C$DW$150, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$150, DW_AT_name("rsvd8")
	.dwattr $C$DW$150, DW_AT_TI_symbol_name("rsvd8")
	.dwattr $C$DW$150, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
	.dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$150, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$150, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$150, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$30

	.dwattr $C$DW$T$30, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
$C$DW$T$62	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$30)

$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
$C$DW$151	.dwtag  DW_TAG_member
	.dwattr $C$DW$151, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$151, DW_AT_name("REVID1")
	.dwattr $C$DW$151, DW_AT_TI_symbol_name("REVID1")
	.dwattr $C$DW$151, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
	.dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$151, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$151, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$151, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$31

	.dwattr $C$DW$T$31, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x12)
$C$DW$T$64	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$31)

$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
$C$DW$152	.dwtag  DW_TAG_member
	.dwattr $C$DW$152, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$152, DW_AT_name("REVID2")
	.dwattr $C$DW$152, DW_AT_TI_symbol_name("REVID2")
	.dwattr $C$DW$152, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
	.dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$152, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$152, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$152, DW_AT_decl_column(0x0d)
$C$DW$153	.dwtag  DW_TAG_member
	.dwattr $C$DW$153, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$153, DW_AT_name("rsvd8")
	.dwattr $C$DW$153, DW_AT_TI_symbol_name("rsvd8")
	.dwattr $C$DW$153, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
	.dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$153, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$153, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$153, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$32

	.dwattr $C$DW$T$32, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x12)
$C$DW$T$66	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$32)

$C$DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
$C$DW$154	.dwtag  DW_TAG_member
	.dwattr $C$DW$154, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$154, DW_AT_name("FREE")
	.dwattr $C$DW$154, DW_AT_TI_symbol_name("FREE")
	.dwattr $C$DW$154, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$154, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$154, DW_AT_decl_line(0x106)
	.dwattr $C$DW$154, DW_AT_decl_column(0x0d)
$C$DW$155	.dwtag  DW_TAG_member
	.dwattr $C$DW$155, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$155, DW_AT_name("rsvd1")
	.dwattr $C$DW$155, DW_AT_TI_symbol_name("rsvd1")
	.dwattr $C$DW$155, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x0c)
	.dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$155, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$155, DW_AT_decl_line(0x107)
	.dwattr $C$DW$155, DW_AT_decl_column(0x0d)
$C$DW$156	.dwtag  DW_TAG_member
	.dwattr $C$DW$156, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$156, DW_AT_name("URRST")
	.dwattr $C$DW$156, DW_AT_TI_symbol_name("URRST")
	.dwattr $C$DW$156, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
	.dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$156, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$156, DW_AT_decl_line(0x108)
	.dwattr $C$DW$156, DW_AT_decl_column(0x0d)
$C$DW$157	.dwtag  DW_TAG_member
	.dwattr $C$DW$157, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$157, DW_AT_name("UTRST")
	.dwattr $C$DW$157, DW_AT_TI_symbol_name("UTRST")
	.dwattr $C$DW$157, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
	.dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$157, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$157, DW_AT_decl_line(0x109)
	.dwattr $C$DW$157, DW_AT_decl_column(0x0d)
$C$DW$158	.dwtag  DW_TAG_member
	.dwattr $C$DW$158, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$158, DW_AT_name("rsvd15")
	.dwattr $C$DW$158, DW_AT_TI_symbol_name("rsvd15")
	.dwattr $C$DW$158, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x11)
	.dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$158, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$158, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$158, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$33

	.dwattr $C$DW$T$33, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$33, DW_AT_decl_line(0x105)
	.dwattr $C$DW$T$33, DW_AT_decl_column(0x12)
$C$DW$T$68	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$33)

$C$DW$T$34	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x04)
$C$DW$159	.dwtag  DW_TAG_member
	.dwattr $C$DW$159, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$159, DW_AT_name("OSM_SEL")
	.dwattr $C$DW$159, DW_AT_TI_symbol_name("OSM_SEL")
	.dwattr $C$DW$159, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$159, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$159, DW_AT_decl_line(0x114)
	.dwattr $C$DW$159, DW_AT_decl_column(0x0d)
$C$DW$160	.dwtag  DW_TAG_member
	.dwattr $C$DW$160, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$160, DW_AT_name("rsvd1")
	.dwattr $C$DW$160, DW_AT_TI_symbol_name("rsvd1")
	.dwattr $C$DW$160, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
	.dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$160, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$160, DW_AT_decl_line(0x115)
	.dwattr $C$DW$160, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$34

	.dwattr $C$DW$T$34, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$34, DW_AT_decl_line(0x113)
	.dwattr $C$DW$T$34, DW_AT_decl_column(0x12)
$C$DW$T$70	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$34)
$C$DW$T$83	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$T$83, DW_AT_address_class(0x20)

$C$DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x38)
$C$DW$161	.dwtag  DW_TAG_member
	.dwattr $C$DW$161, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$161, DW_AT_name("$P$T2")
	.dwattr $C$DW$161, DW_AT_TI_symbol_name("$P$T2")
	.dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$161, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$161, DW_AT_decl_line(0x35)
	.dwattr $C$DW$161, DW_AT_decl_column(0x02)
$C$DW$162	.dwtag  DW_TAG_member
	.dwattr $C$DW$162, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$162, DW_AT_name("$P$T3")
	.dwattr $C$DW$162, DW_AT_TI_symbol_name("$P$T3")
	.dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$162, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$162, DW_AT_decl_line(0x54)
	.dwattr $C$DW$162, DW_AT_decl_column(0x02)
$C$DW$163	.dwtag  DW_TAG_member
	.dwattr $C$DW$163, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$163, DW_AT_name("$P$T6")
	.dwattr $C$DW$163, DW_AT_TI_symbol_name("$P$T6")
	.dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$163, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$163, DW_AT_decl_line(0x67)
	.dwattr $C$DW$163, DW_AT_decl_column(0x02)
$C$DW$164	.dwtag  DW_TAG_member
	.dwattr $C$DW$164, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$164, DW_AT_name("$P$T7")
	.dwattr $C$DW$164, DW_AT_TI_symbol_name("$P$T7")
	.dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$164, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$164, DW_AT_decl_line(0x87)
	.dwattr $C$DW$164, DW_AT_decl_column(0x02)
$C$DW$165	.dwtag  DW_TAG_member
	.dwattr $C$DW$165, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$165, DW_AT_name("$P$T8")
	.dwattr $C$DW$165, DW_AT_TI_symbol_name("$P$T8")
	.dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$165, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$165, DW_AT_decl_line(0x98)
	.dwattr $C$DW$165, DW_AT_decl_column(0x02)
$C$DW$166	.dwtag  DW_TAG_member
	.dwattr $C$DW$166, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$166, DW_AT_name("$P$T9")
	.dwattr $C$DW$166, DW_AT_TI_symbol_name("$P$T9")
	.dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$166, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$166, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$166, DW_AT_decl_column(0x02)
$C$DW$167	.dwtag  DW_TAG_member
	.dwattr $C$DW$167, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$167, DW_AT_name("$P$T10")
	.dwattr $C$DW$167, DW_AT_TI_symbol_name("$P$T10")
	.dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$167, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$167, DW_AT_decl_line(0xba)
	.dwattr $C$DW$167, DW_AT_decl_column(0x02)
$C$DW$168	.dwtag  DW_TAG_member
	.dwattr $C$DW$168, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$168, DW_AT_name("$P$T11")
	.dwattr $C$DW$168, DW_AT_TI_symbol_name("$P$T11")
	.dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$168, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$168, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$168, DW_AT_decl_column(0x02)
$C$DW$169	.dwtag  DW_TAG_member
	.dwattr $C$DW$169, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$169, DW_AT_name("$P$T12")
	.dwattr $C$DW$169, DW_AT_TI_symbol_name("$P$T12")
	.dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$169, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$169, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$169, DW_AT_decl_column(0x02)
$C$DW$170	.dwtag  DW_TAG_member
	.dwattr $C$DW$170, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$170, DW_AT_name("$P$T13")
	.dwattr $C$DW$170, DW_AT_TI_symbol_name("$P$T13")
	.dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$170, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$170, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$170, DW_AT_decl_column(0x02)
$C$DW$171	.dwtag  DW_TAG_member
	.dwattr $C$DW$171, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$171, DW_AT_name("$P$T14")
	.dwattr $C$DW$171, DW_AT_TI_symbol_name("$P$T14")
	.dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$171, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$171, DW_AT_decl_line(0xed)
	.dwattr $C$DW$171, DW_AT_decl_column(0x02)
$C$DW$172	.dwtag  DW_TAG_member
	.dwattr $C$DW$172, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$172, DW_AT_name("$P$T15")
	.dwattr $C$DW$172, DW_AT_TI_symbol_name("$P$T15")
	.dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$172, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$172, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$172, DW_AT_decl_column(0x02)
$C$DW$173	.dwtag  DW_TAG_member
	.dwattr $C$DW$173, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$173, DW_AT_name("$P$T16")
	.dwattr $C$DW$173, DW_AT_TI_symbol_name("$P$T16")
	.dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$173, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$173, DW_AT_decl_line(0x102)
	.dwattr $C$DW$173, DW_AT_decl_column(0x02)
$C$DW$174	.dwtag  DW_TAG_member
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$174, DW_AT_name("$P$T17")
	.dwattr $C$DW$174, DW_AT_TI_symbol_name("$P$T17")
	.dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$174, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$174, DW_AT_decl_line(0x110)
	.dwattr $C$DW$174, DW_AT_decl_column(0x02)
	.dwendtag $C$DW$T$35

	.dwattr $C$DW$T$35, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
$C$DW$T$86	.dwtag  DW_TAG_typedef, DW_AT_name("pruUart")
	.dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$86, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$86, DW_AT_decl_line(0x119)
	.dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
$C$DW$T$87	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)

$C$DW$T$39	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
$C$DW$175	.dwtag  DW_TAG_member
	.dwattr $C$DW$175, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$175, DW_AT_name("RBR")
	.dwattr $C$DW$175, DW_AT_TI_symbol_name("RBR")
	.dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$175, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$175, DW_AT_decl_line(0x38)
	.dwattr $C$DW$175, DW_AT_decl_column(0x16)
$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$176, DW_AT_name("RBR_bit")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("RBR_bit")
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$176, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$176, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$176, DW_AT_decl_column(0x06)
	.dwendtag $C$DW$T$39

	.dwattr $C$DW$T$39, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0x37)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x09)

$C$DW$T$41	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
$C$DW$177	.dwtag  DW_TAG_member
	.dwattr $C$DW$177, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$177, DW_AT_name("THR")
	.dwattr $C$DW$177, DW_AT_TI_symbol_name("THR")
	.dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$177, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$177, DW_AT_decl_line(0x42)
	.dwattr $C$DW$177, DW_AT_decl_column(0x16)
$C$DW$178	.dwtag  DW_TAG_member
	.dwattr $C$DW$178, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$178, DW_AT_name("THR_bit")
	.dwattr $C$DW$178, DW_AT_TI_symbol_name("THR_bit")
	.dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$178, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$178, DW_AT_decl_line(0x47)
	.dwattr $C$DW$178, DW_AT_decl_column(0x06)
	.dwendtag $C$DW$T$41

	.dwattr $C$DW$T$41, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x09)

$C$DW$T$42	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
$C$DW$179	.dwtag  DW_TAG_member
	.dwattr $C$DW$179, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$179, DW_AT_name("$P$T0")
	.dwattr $C$DW$179, DW_AT_TI_symbol_name("$P$T0")
	.dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$179, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$179, DW_AT_decl_line(0x37)
	.dwattr $C$DW$179, DW_AT_decl_column(0x03)
$C$DW$180	.dwtag  DW_TAG_member
	.dwattr $C$DW$180, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$180, DW_AT_name("$P$T1")
	.dwattr $C$DW$180, DW_AT_TI_symbol_name("$P$T1")
	.dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$180, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$180, DW_AT_decl_line(0x41)
	.dwattr $C$DW$180, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$42

	.dwattr $C$DW$T$42, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x35)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x08)

$C$DW$T$44	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
$C$DW$181	.dwtag  DW_TAG_member
	.dwattr $C$DW$181, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$181, DW_AT_name("IER")
	.dwattr $C$DW$181, DW_AT_TI_symbol_name("IER")
	.dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$181, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$181, DW_AT_decl_line(0x55)
	.dwattr $C$DW$181, DW_AT_decl_column(0x15)
$C$DW$182	.dwtag  DW_TAG_member
	.dwattr $C$DW$182, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$182, DW_AT_name("IER_bit")
	.dwattr $C$DW$182, DW_AT_TI_symbol_name("IER_bit")
	.dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$182, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$182, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$182, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$44

	.dwattr $C$DW$T$44, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0x54)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x08)

$C$DW$T$46	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
$C$DW$183	.dwtag  DW_TAG_member
	.dwattr $C$DW$183, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$183, DW_AT_name("IIR")
	.dwattr $C$DW$183, DW_AT_TI_symbol_name("IIR")
	.dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$183, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$183, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$183, DW_AT_decl_column(0x16)
$C$DW$184	.dwtag  DW_TAG_member
	.dwattr $C$DW$184, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$184, DW_AT_name("IIR_bit")
	.dwattr $C$DW$184, DW_AT_TI_symbol_name("IIR_bit")
	.dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$184, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$184, DW_AT_decl_line(0x72)
	.dwattr $C$DW$184, DW_AT_decl_column(0x06)
	.dwendtag $C$DW$T$46

	.dwattr $C$DW$T$46, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0x69)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x09)

$C$DW$T$48	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
$C$DW$185	.dwtag  DW_TAG_member
	.dwattr $C$DW$185, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$185, DW_AT_name("FCR")
	.dwattr $C$DW$185, DW_AT_TI_symbol_name("FCR")
	.dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$185, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$185, DW_AT_decl_line(0x77)
	.dwattr $C$DW$185, DW_AT_decl_column(0x16)
$C$DW$186	.dwtag  DW_TAG_member
	.dwattr $C$DW$186, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$186, DW_AT_name("FCR_bit")
	.dwattr $C$DW$186, DW_AT_TI_symbol_name("FCR_bit")
	.dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$186, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$186, DW_AT_decl_line(0x81)
	.dwattr $C$DW$186, DW_AT_decl_column(0x06)
	.dwendtag $C$DW$T$48

	.dwattr $C$DW$T$48, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$48, DW_AT_decl_line(0x76)
	.dwattr $C$DW$T$48, DW_AT_decl_column(0x09)

$C$DW$T$49	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x04)
$C$DW$187	.dwtag  DW_TAG_member
	.dwattr $C$DW$187, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$187, DW_AT_name("$P$T4")
	.dwattr $C$DW$187, DW_AT_TI_symbol_name("$P$T4")
	.dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$187, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$187, DW_AT_decl_line(0x69)
	.dwattr $C$DW$187, DW_AT_decl_column(0x03)
$C$DW$188	.dwtag  DW_TAG_member
	.dwattr $C$DW$188, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$188, DW_AT_name("$P$T5")
	.dwattr $C$DW$188, DW_AT_TI_symbol_name("$P$T5")
	.dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$188, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$188, DW_AT_decl_line(0x76)
	.dwattr $C$DW$188, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$49

	.dwattr $C$DW$T$49, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$49, DW_AT_decl_line(0x67)
	.dwattr $C$DW$T$49, DW_AT_decl_column(0x08)

$C$DW$T$51	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x04)
$C$DW$189	.dwtag  DW_TAG_member
	.dwattr $C$DW$189, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$189, DW_AT_name("LCR")
	.dwattr $C$DW$189, DW_AT_TI_symbol_name("LCR")
	.dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$189, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$189, DW_AT_decl_line(0x88)
	.dwattr $C$DW$189, DW_AT_decl_column(0x15)
$C$DW$190	.dwtag  DW_TAG_member
	.dwattr $C$DW$190, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$190, DW_AT_name("LCR_bit")
	.dwattr $C$DW$190, DW_AT_TI_symbol_name("LCR_bit")
	.dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$190, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$190, DW_AT_decl_line(0x93)
	.dwattr $C$DW$190, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$51

	.dwattr $C$DW$T$51, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0x87)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x08)

$C$DW$T$53	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x04)
$C$DW$191	.dwtag  DW_TAG_member
	.dwattr $C$DW$191, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$191, DW_AT_name("MCR")
	.dwattr $C$DW$191, DW_AT_TI_symbol_name("MCR")
	.dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$191, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$191, DW_AT_decl_line(0x99)
	.dwattr $C$DW$191, DW_AT_decl_column(0x15)
$C$DW$192	.dwtag  DW_TAG_member
	.dwattr $C$DW$192, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$192, DW_AT_name("MCR_bit")
	.dwattr $C$DW$192, DW_AT_TI_symbol_name("MCR_bit")
	.dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$192, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$192, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$192, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$53

	.dwattr $C$DW$T$53, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0x98)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x08)

$C$DW$T$55	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x04)
$C$DW$193	.dwtag  DW_TAG_member
	.dwattr $C$DW$193, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$193, DW_AT_name("LSR")
	.dwattr $C$DW$193, DW_AT_TI_symbol_name("LSR")
	.dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$193, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$193, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$193, DW_AT_decl_column(0x15)
$C$DW$194	.dwtag  DW_TAG_member
	.dwattr $C$DW$194, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$194, DW_AT_name("LSR_bit")
	.dwattr $C$DW$194, DW_AT_TI_symbol_name("LSR_bit")
	.dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$194, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$194, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$194, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$55

	.dwattr $C$DW$T$55, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x08)

$C$DW$T$57	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x04)
$C$DW$195	.dwtag  DW_TAG_member
	.dwattr $C$DW$195, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$195, DW_AT_name("MSR")
	.dwattr $C$DW$195, DW_AT_TI_symbol_name("MSR")
	.dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$195, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$195, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$195, DW_AT_decl_column(0x15)
$C$DW$196	.dwtag  DW_TAG_member
	.dwattr $C$DW$196, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$196, DW_AT_name("MSR_bit")
	.dwattr $C$DW$196, DW_AT_TI_symbol_name("MSR_bit")
	.dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$196, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$196, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$196, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$57

	.dwattr $C$DW$T$57, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0xba)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x08)

$C$DW$T$59	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x04)
$C$DW$197	.dwtag  DW_TAG_member
	.dwattr $C$DW$197, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$197, DW_AT_name("SCR")
	.dwattr $C$DW$197, DW_AT_TI_symbol_name("SCR")
	.dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$197, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$197, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$197, DW_AT_decl_column(0x15)
$C$DW$198	.dwtag  DW_TAG_member
	.dwattr $C$DW$198, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$198, DW_AT_name("SCR_bit")
	.dwattr $C$DW$198, DW_AT_TI_symbol_name("SCR_bit")
	.dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$198, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$198, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$198, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$59

	.dwattr $C$DW$T$59, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$59, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$T$59, DW_AT_decl_column(0x08)

$C$DW$T$61	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
$C$DW$199	.dwtag  DW_TAG_member
	.dwattr $C$DW$199, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$199, DW_AT_name("DLL")
	.dwattr $C$DW$199, DW_AT_TI_symbol_name("DLL")
	.dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$199, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$199, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$199, DW_AT_decl_column(0x15)
$C$DW$200	.dwtag  DW_TAG_member
	.dwattr $C$DW$200, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$200, DW_AT_name("DLL_bit")
	.dwattr $C$DW$200, DW_AT_TI_symbol_name("DLL_bit")
	.dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$200, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$200, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$200, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$61

	.dwattr $C$DW$T$61, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$61, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$T$61, DW_AT_decl_column(0x08)

$C$DW$T$63	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
$C$DW$201	.dwtag  DW_TAG_member
	.dwattr $C$DW$201, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$201, DW_AT_name("DLH")
	.dwattr $C$DW$201, DW_AT_TI_symbol_name("DLH")
	.dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$201, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$201, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$201, DW_AT_decl_column(0x15)
$C$DW$202	.dwtag  DW_TAG_member
	.dwattr $C$DW$202, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$202, DW_AT_name("DLH_bit")
	.dwattr $C$DW$202, DW_AT_TI_symbol_name("DLH_bit")
	.dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$202, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$202, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$202, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$63

	.dwattr $C$DW$T$63, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x08)

$C$DW$T$65	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
$C$DW$203	.dwtag  DW_TAG_member
	.dwattr $C$DW$203, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$203, DW_AT_name("REVID1")
	.dwattr $C$DW$203, DW_AT_TI_symbol_name("REVID1")
	.dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$203, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$203, DW_AT_decl_line(0xee)
	.dwattr $C$DW$203, DW_AT_decl_column(0x15)
$C$DW$204	.dwtag  DW_TAG_member
	.dwattr $C$DW$204, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$204, DW_AT_name("REVID1_bit")
	.dwattr $C$DW$204, DW_AT_TI_symbol_name("REVID1_bit")
	.dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$204, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$204, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$204, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$65

	.dwattr $C$DW$T$65, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0xed)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x08)

$C$DW$T$67	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
$C$DW$205	.dwtag  DW_TAG_member
	.dwattr $C$DW$205, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$205, DW_AT_name("REVID2")
	.dwattr $C$DW$205, DW_AT_TI_symbol_name("REVID2")
	.dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$205, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$205, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$205, DW_AT_decl_column(0x15)
$C$DW$206	.dwtag  DW_TAG_member
	.dwattr $C$DW$206, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$206, DW_AT_name("REVID2_bit")
	.dwattr $C$DW$206, DW_AT_TI_symbol_name("REVID2_bit")
	.dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$206, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$206, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$206, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$67

	.dwattr $C$DW$T$67, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$67, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$T$67, DW_AT_decl_column(0x08)

$C$DW$T$69	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x04)
$C$DW$207	.dwtag  DW_TAG_member
	.dwattr $C$DW$207, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$207, DW_AT_name("PWREMU_MGMT")
	.dwattr $C$DW$207, DW_AT_TI_symbol_name("PWREMU_MGMT")
	.dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$207, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$207, DW_AT_decl_line(0x103)
	.dwattr $C$DW$207, DW_AT_decl_column(0x15)
$C$DW$208	.dwtag  DW_TAG_member
	.dwattr $C$DW$208, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$208, DW_AT_name("PWREMU_MGMT_bit")
	.dwattr $C$DW$208, DW_AT_TI_symbol_name("PWREMU_MGMT_bit")
	.dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$208, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$208, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$208, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$69

	.dwattr $C$DW$T$69, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$69, DW_AT_decl_line(0x102)
	.dwattr $C$DW$T$69, DW_AT_decl_column(0x08)

$C$DW$T$71	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$71, DW_AT_byte_size(0x04)
$C$DW$209	.dwtag  DW_TAG_member
	.dwattr $C$DW$209, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$209, DW_AT_name("MDR")
	.dwattr $C$DW$209, DW_AT_TI_symbol_name("MDR")
	.dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$209, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$209, DW_AT_decl_line(0x111)
	.dwattr $C$DW$209, DW_AT_decl_column(0x15)
$C$DW$210	.dwtag  DW_TAG_member
	.dwattr $C$DW$210, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$210, DW_AT_name("MDR_bit")
	.dwattr $C$DW$210, DW_AT_TI_symbol_name("MDR_bit")
	.dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$210, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$210, DW_AT_decl_line(0x116)
	.dwattr $C$DW$210, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$71

	.dwattr $C$DW$T$71, DW_AT_decl_file("TI_Headers/pru_uart.h")
	.dwattr $C$DW$T$71, DW_AT_decl_line(0x110)
	.dwattr $C$DW$T$71, DW_AT_decl_column(0x08)
$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$95	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$95, DW_AT_address_class(0x20)
$C$DW$T$97	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$6)
$C$DW$T$99	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$T$99, DW_AT_address_class(0x20)
$C$DW$T$101	.dwtag  DW_TAG_typedef, DW_AT_name("tBoolean")
	.dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$101, DW_AT_decl_file("C:/ti/AM335X_StarterWare_02_00_01_01/include/hw/hw_types.h")
	.dwattr $C$DW$T$101, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$101, DW_AT_decl_column(0x17)
$C$DW$T$102	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
$C$DW$T$74	.dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$74, DW_AT_decl_file("C:/ti/AM335X_StarterWare_02_00_01_01/PRUCodeGenerationTools/include/stdint.h")
	.dwattr $C$DW$T$74, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$T$74, DW_AT_decl_column(0x1c)
$C$DW$T$75	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$T$75, DW_AT_address_class(0x20)
$C$DW$T$103	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$75)
$C$DW$T$104	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$74)

$C$DW$T$105	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$105, DW_AT_byte_size(0x100)
$C$DW$211	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$211, DW_AT_upper_bound(0xff)
	.dwendtag $C$DW$T$105

$C$DW$T$106	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$74)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x04)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
$C$DW$T$107	.dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
	.dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$107, DW_AT_decl_file("C:/ti/AM335X_StarterWare_02_00_01_01/PRUCodeGenerationTools/include/stdint.h")
	.dwattr $C$DW$T$107, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$T$107, DW_AT_decl_column(0x1c)
$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
